read_rtlil ../rtlil/slang/always_assert.il
hierarchy -auto-top
proc
opt_clean
check -initdrv
setundef -undriven -undef
write_rtlil always_assert/gate.il
